#Область ПрограммныйИнтерфейс
  //добавление реквизита Контактное лицо на форму
  Процедура ДополнитьФорму(Форма) Экспорт  
	  
	  ИмяФормы = Форма.ИмяФормы;
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		  ДобавитьИмяКонтактноеЛицоВГруппаШапкаПраво(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		  ДобавитьИмяКонтактноеЛицоВГруппаШапкаПраво(Форма);
	  ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		  ДобавитьИмяКонтактноеЛицоВГруппаШапкаПраво(Форма);
	  ИначеЕсли  ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	  ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	  КонецЕсли; 



		  
	  КонецПроцедуры
	  
	  
	  #КонецОбласти  
  
  #Область СлужебныйПрограммныйИнтерфейс
  
  Процедура ДобавитьИмяКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	  
	  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	  
  КонецПроцедуры 
  
  Процедура ДобавитьИмяСогласованнаяСкидкаВГруппаШапкаЛево(Форма) Экспорт
	  
	  ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДК_СогласованнаяСкидка"; 
	  ПолеВвода.УстановитьДействие("ПриИзменении", "ДК_СогласованнаяСкидкаПриИзменении");
	  
  КонецПроцедуры  
  
 

  
  Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) Экспорт
	  
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	  
	  
  КонецПроцедуры
  
  	
  #КонецОбласти